# GetDefaultNameForNoteBlock Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetDefaultNameForNoteBlock Method
ViewSchedule Class See Also
---
Gets the default view name that will be used when creating a note block.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static string GetDefaultNameForNoteBlock(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetDefaultNameForNoteBlock ( _
	document As Document _
) As String
```

Visual C++
---
```text
public:
static String^ GetDefaultNameForNoteBlock(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to which the new schedule will be added.
# ### Return Value
The default view name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | document is not a project document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace